WcfHarness/WcfHarness/RequestXmls/CreateUserGroup.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateUserGroup xmlns="http://www.tavisca.com/Vexiere/IUserGroup/2013/01">
      <createUserRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData>
          <a:KeyValueState>
            <a:AccessModifier>Public</a:AccessModifier>
            <a:OwnerOrganizationId>0</a:OwnerOrganizationId>
            <a:Key>IpAddress</a:Key>
            <a:Value>192.168.1.11</a:Value>
          </a:KeyValueState>
          <a:KeyValueState>
            <a:AccessModifier>Public</a:AccessModifier>
            <a:OwnerOrganizationId>0</a:OwnerOrganizationId>
            <a:Key>UserSessionId</a:Key>
            <a:Value>f9e8bd46-2b5f-461a-be4c-eb5132f2af9e</a:Value>
          </a:KeyValueState>
        </a:AdditionalData>
        <a:OwnerOrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OwnerOrganizationIdentifier>
        <a:UserGroup>
          <a:CreatedOn>0001-01-01T00:00:00</a:CreatedOn>
          <a:Id>0</a:Id>
          <a:ModifiedOn>0001-01-01T00:00:00</a:ModifiedOn>
          <a:Status>Active</a:Status>
          <a:Description>Test group description.</a:Description>
          <a:IsDefault>false</a:IsDefault>
          <a:Name>9952be26-5c06-4df2-ac7d-587e918d348f</a:Name>
        </a:UserGroup>
      </createUserRequest>
    </CreateUserGroup>
  </s:Body>
</s:Envelope>